trol73/avr-make/asm/include/ATxmega16C4def.inc
; Event Action
.equ TC_EVACT_OFF_gc = (0x00<<5) ; No Event Action
.equ TC_EVACT_CAPT_gc = (0x01<<5) ; Input Capture
.equ TC_EVACT_UPDOWN_gc = (0x02<<5) ; Externally Controlled Up/Down Count
.equ TC_EVACT_QDEC_gc = (0x03<<5) ; Quadrature Decode
.equ TC_EVACT_RESTART_gc = (0x04<<5) ; Restart
.equ TC_EVACT_FRQ_gc = (0x05<<5) ; Frequency Capture
.equ TC_EVACT_PW_gc = (0x06<<5) ; Pulse-width Capture

; Event Selection
.equ TC_EVSEL_OFF_gc = (0x00<<0) ; No Event Source
.equ TC_EVSEL_CH0_gc = (0x08<<0) ; Event Channel 0
.equ TC_EVSEL_CH1_gc = (0x09<<0) ; Event Channel 1
.equ TC_EVSEL_CH2_gc = (0x0A<<0) ; Event Channel 2
.equ TC_EVSEL_CH3_gc = (0x0B<<0) ; Event Channel 3

; Error Interrupt Level
.equ TC_ERRINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ TC_ERRINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ TC_ERRINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ TC_ERRINTLVL_HI_gc = (0x03<<2) ; High Level

; Overflow Interrupt Level
.equ TC_OVFINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ TC_OVFINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ TC_OVFINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ TC_OVFINTLVL_HI_gc = (0x03<<0) ; High Level

; Compare or Capture D Interrupt Level
.equ TC_CCDINTLVL_OFF_gc = (0x00<<6) ; Interrupt Disabled
.equ TC_CCDINTLVL_LO_gc = (0x01<<6) ; Low Level
.equ TC_CCDINTLVL_MED_gc = (0x02<<6) ; Medium Level
.equ TC_CCDINTLVL_HI_gc = (0x03<<6) ; High Level

; Compare or Capture C Interrupt Level
.equ TC_CCCINTLVL_OFF_gc = (0x00<<4) ; Interrupt Disabled
.equ TC_CCCINTLVL_LO_gc = (0x01<<4) ; Low Level
.equ TC_CCCINTLVL_MED_gc = (0x02<<4) ; Medium Level
.equ TC_CCCINTLVL_HI_gc = (0x03<<4) ; High Level

; Compare or Capture B Interrupt Level
.equ TC_CCBINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ TC_CCBINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ TC_CCBINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ TC_CCBINTLVL_HI_gc = (0x03<<2) ; High Level

; Compare or Capture A Interrupt Level
.equ TC_CCAINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ TC_CCAINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ TC_CCAINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ TC_CCAINTLVL_HI_gc = (0x03<<0) ; High Level

; Timer/Counter Command
.equ TC_CMD_NONE_gc = (0x00<<2) ; No Command
.equ TC_CMD_UPDATE_gc = (0x01<<2) ; Force Update
.equ TC_CMD_RESTART_gc = (0x02<<2) ; Force Restart
.equ TC_CMD_RESET_gc = (0x03<<2) ; Force Hard Reset


;***************************************************************************
;** TC2 - 16-bit Timer/Counter type 2
;***************************************************************************/

; TC2_CTRLA masks
.equ TC2_CLKSEL_gm = 0x0F ; Clock Selection group mask
.equ TC2_CLKSEL_gp = 0 ; Clock Selection group position
.equ TC2_CLKSEL0_bm = (1<<0) ; Clock Selection bit 0 mask
.equ TC2_CLKSEL0_bp = 0 ; Clock Selection bit 0 position
.equ TC2_CLKSEL1_bm = (1<<1) ; Clock Selection bit 1 mask
.equ TC2_CLKSEL1_bp = 1 ; Clock Selection bit 1 position
.equ TC2_CLKSEL2_bm = (1<<2) ; Clock Selection bit 2 mask
.equ TC2_CLKSEL2_bp = 2 ; Clock Selection bit 2 position
.equ TC2_CLKSEL3_bm = (1<<3) ; Clock Selection bit 3 mask
.equ TC2_CLKSEL3_bp = 3 ; Clock Selection bit 3 position

; TC2_CTRLB masks
.equ TC2_HCMPDEN_bm = 0x80 ; High Byte Compare D Enable bit mask
.equ TC2_HCMPDEN_bp = 7 ; High Byte Compare D Enable bit position
.equ TC2_HCMPCEN_bm = 0x40 ; High Byte Compare C Enable bit mask
.equ TC2_HCMPCEN_bp = 6 ; High Byte Compare C Enable bit position
.equ TC2_HCMPBEN_bm = 0x20 ; High Byte Compare B Enable bit mask
.equ TC2_HCMPBEN_bp = 5 ; High Byte Compare B Enable bit position
.equ TC2_HCMPAEN_bm = 0x10 ; High Byte Compare A Enable bit mask
.equ TC2_HCMPAEN_bp = 4 ; High Byte Compare A Enable bit position
.equ TC2_LCMPDEN_bm = 0x08 ; Low Byte Compare D Enable bit mask
.equ TC2_LCMPDEN_bp = 3 ; Low Byte Compare D Enable bit position
.equ TC2_LCMPCEN_bm = 0x04 ; Low Byte Compare C Enable bit mask
.equ TC2_LCMPCEN_bp = 2 ; Low Byte Compare C Enable bit position
.equ TC2_LCMPBEN_bm = 0x02 ; Low Byte Compare B Enable bit mask
.equ TC2_LCMPBEN_bp = 1 ; Low Byte Compare B Enable bit position
.equ TC2_LCMPAEN_bm = 0x01 ; Low Byte Compare A Enable bit mask
.equ TC2_LCMPAEN_bp = 0 ; Low Byte Compare A Enable bit position

; TC2_CTRLC masks
.equ TC2_HCMPD_bm = 0x80 ; High Byte Compare D Output Value bit mask
.equ TC2_HCMPD_bp = 7 ; High Byte Compare D Output Value bit position
.equ TC2_HCMPC_bm = 0x40 ; High Byte Compare C Output Value bit mask
.equ TC2_HCMPC_bp = 6 ; High Byte Compare C Output Value bit position
.equ TC2_HCMPB_bm = 0x20 ; High Byte Compare B Output Value bit mask
.equ TC2_HCMPB_bp = 5 ; High Byte Compare B Output Value bit position
.equ TC2_HCMPA_bm = 0x10 ; High Byte Compare A Output Value bit mask
.equ TC2_HCMPA_bp = 4 ; High Byte Compare A Output Value bit position
.equ TC2_LCMPD_bm = 0x08 ; Low Byte Compare D Output Value bit mask
.equ TC2_LCMPD_bp = 3 ; Low Byte Compare D Output Value bit position
.equ TC2_LCMPC_bm = 0x04 ; Low Byte Compare C Output Value bit mask
.equ TC2_LCMPC_bp = 2 ; Low Byte Compare C Output Value bit position
.equ TC2_LCMPB_bm = 0x02 ; Low Byte Compare B Output Value bit mask
.equ TC2_LCMPB_bp = 1 ; Low Byte Compare B Output Value bit position
.equ TC2_LCMPA_bm = 0x01 ; Low Byte Compare A Output Value bit mask
.equ TC2_LCMPA_bp = 0 ; Low Byte Compare A Output Value bit position

; TC2_CTRLE masks
.equ TC2_BYTEM_gm = 0x03 ; Byte Mode group mask
.equ TC2_BYTEM_gp = 0 ; Byte Mode group position
.equ TC2_BYTEM0_bm = (1<<0) ; Byte Mode bit 0 mask
.equ TC2_BYTEM0_bp = 0 ; Byte Mode bit 0 position
.equ TC2_BYTEM1_bm = (1<<1) ; Byte Mode bit 1 mask
.equ TC2_BYTEM1_bp = 1 ; Byte Mode bit 1 position

; TC2_INTCTRLA masks
.equ TC2_HUNFINTLVL_gm = 0x0C ; High Byte Underflow Interrupt Level group mask
.equ TC2_HUNFINTLVL_gp = 2 ; High Byte Underflow Interrupt Level group position
.equ TC2_HUNFINTLVL0_bm = (1<<2) ; High Byte Underflow Interrupt Level bit 0 mask
.equ TC2_HUNFINTLVL0_bp = 2 ; High Byte Underflow Interrupt Level bit 0 position
.equ TC2_HUNFINTLVL1_bm = (1<<3) ; High Byte Underflow Interrupt Level bit 1 mask
.equ TC2_HUNFINTLVL1_bp = 3 ; High Byte Underflow Interrupt Level bit 1 position
.equ TC2_LUNFINTLVL_gm = 0x03 ; Low Byte Underflow interrupt level group mask
.equ TC2_LUNFINTLVL_gp = 0 ; Low Byte Underflow interrupt level group position
.equ TC2_LUNFINTLVL0_bm = (1<<0) ; Low Byte Underflow interrupt level bit 0 mask
.equ TC2_LUNFINTLVL0_bp = 0 ; Low Byte Underflow interrupt level bit 0 position
.equ TC2_LUNFINTLVL1_bm = (1<<1) ; Low Byte Underflow interrupt level bit 1 mask
.equ TC2_LUNFINTLVL1_bp = 1 ; Low Byte Underflow interrupt level bit 1 position

; TC2_INTCTRLB masks
.equ TC2_LCMPDINTLVL_gm = 0xC0 ; Low Byte Compare D Interrupt Level group mask
.equ TC2_LCMPDINTLVL_gp = 6 ; Low Byte Compare D Interrupt Level group position
.equ TC2_LCMPDINTLVL0_bm = (1<<6) ; Low Byte Compare D Interrupt Level bit 0 mask
.equ TC2_LCMPDINTLVL0_bp = 6 ; Low Byte Compare D Interrupt Level bit 0 position
.equ TC2_LCMPDINTLVL1_bm = (1<<7) ; Low Byte Compare D Interrupt Level bit 1 mask
.equ TC2_LCMPDINTLVL1_bp = 7 ; Low Byte Compare D Interrupt Level bit 1 position
.equ TC2_LCMPCINTLVL_gm = 0x30 ; Low Byte Compare C Interrupt Level group mask
.equ TC2_LCMPCINTLVL_gp = 4 ; Low Byte Compare C Interrupt Level group position
.equ TC2_LCMPCINTLVL0_bm = (1<<4) ; Low Byte Compare C Interrupt Level bit 0 mask
.equ TC2_LCMPCINTLVL0_bp = 4 ; Low Byte Compare C Interrupt Level bit 0 position
.equ TC2_LCMPCINTLVL1_bm = (1<<5) ; Low Byte Compare C Interrupt Level bit 1 mask
.equ TC2_LCMPCINTLVL1_bp = 5 ; Low Byte Compare C Interrupt Level bit 1 position
.equ TC2_LCMPBINTLVL_gm = 0x0C ; Low Byte Compare B Interrupt Level group mask
.equ TC2_LCMPBINTLVL_gp = 2 ; Low Byte Compare B Interrupt Level group position
.equ TC2_LCMPBINTLVL0_bm = (1<<2) ; Low Byte Compare B Interrupt Level bit 0 mask
.equ TC2_LCMPBINTLVL0_bp = 2 ; Low Byte Compare B Interrupt Level bit 0 position
.equ TC2_LCMPBINTLVL1_bm = (1<<3) ; Low Byte Compare B Interrupt Level bit 1 mask
.equ TC2_LCMPBINTLVL1_bp = 3 ; Low Byte Compare B Interrupt Level bit 1 position
.equ TC2_LCMPAINTLVL_gm = 0x03 ; Low Byte Compare A Interrupt Level group mask
.equ TC2_LCMPAINTLVL_gp = 0 ; Low Byte Compare A Interrupt Level group position
.equ TC2_LCMPAINTLVL0_bm = (1<<0) ; Low Byte Compare A Interrupt Level bit 0 mask
.equ TC2_LCMPAINTLVL0_bp = 0 ; Low Byte Compare A Interrupt Level bit 0 position
.equ TC2_LCMPAINTLVL1_bm = (1<<1) ; Low Byte Compare A Interrupt Level bit 1 mask
.equ TC2_LCMPAINTLVL1_bp = 1 ; Low Byte Compare A Interrupt Level bit 1 position

; TC2_CTRLF masks
.equ TC2_CMD_gm = 0x0C ; Command group mask
.equ TC2_CMD_gp = 2 ; Command group position
.equ TC2_CMD0_bm = (1<<2) ; Command bit 0 mask
.equ TC2_CMD0_bp = 2 ; Command bit 0 position
.equ TC2_CMD1_bm = (1<<3) ; Command bit 1 mask
.equ TC2_CMD1_bp = 3 ; Command bit 1 position
.equ TC2_CMDEN_gm = 0x03 ; Command Enable group mask
.equ TC2_CMDEN_gp = 0 ; Command Enable group position
.equ TC2_CMDEN0_bm = (1<<0) ; Command Enable bit 0 mask
.equ TC2_CMDEN0_bp = 0 ; Command Enable bit 0 position
.equ TC2_CMDEN1_bm = (1<<1) ; Command Enable bit 1 mask
.equ TC2_CMDEN1_bp = 1 ; Command Enable bit 1 position

